[Cues]
Cue_E3_6A_ChloeCar_InsideChloeCar_Chloe_020="Oh, so you're not defending him anymore? Make up your mind..."
Cue_E3_6A_ChloeCar_InsideChloeCar_Chloe_050="That sounds ominous. I don't know if I can handle more bad news..."
Cue_E3_6A_ChloeCar_InsideChloeCar_Chloe_065="Right. No way, Max. She was just posing to tease Frank."
Cue_E3_6A_ChloeCar_InsideChloeCar_Chloe_080="What's that gonna prove?"
Cue_E3_6A_ChloeCar_InsideChloeCar_Chloe_100="Motherfucker better not have anything. For his sake."
Cue_E3_6A_ChloeCar_InsideChloeCar_Max_010="Listen, I have to talk to you about what I found in David's files..."
Cue_E3_6A_ChloeCar_InsideChloeCar_Max_030="You definitely need to know this."
Cue_E3_6A_ChloeCar_InsideChloeCar_Max_040="Listen, I have to talk to you about what I found in David's files..."
Cue_E3_6A_ChloeCar_InsideChloeCar_Max_060="You definitely need to know this."
Cue_E3_6A_ChloeCar_InsideChloeCar_Max_062="Listen, when I went through David's laptop, I found pictures of Rachel and Frank... being more than friends."
Cue_E3_6A_ChloeCar_InsideChloeCar_Max_067="Right Chloe, what do I know about photography? These were not head-shots for Hollywood. You're in denial. Let's go check out Frank's RV so you can see for yourself... Hey look, there it is parked by the diner! "
Cue_E3_6A_ChloeCar_InsideChloeCar_Max_070="If you're not going to believe me, why don't we check out what Frank has in his RV?"
Cue_E3_6A_ChloeCar_InsideChloeCar_Max_090="Frank has Rachel's bracelet. What else does he have in there?"
Cue_E3_6A_TownCar_CHChloe_Phase01_Chloe_006="I gotta blame somebody. Otherwise it's all my fault. Fuck that."
Cue_E3_6A_TownCar_CHChloe_Phase01_Chloe_007="Yes, Kate Marsh killed herself. She's dead. Such sad. Okay? That doesn't make me feel any better about my fucked-up life, get it?"
Cue_E3_6A_TownCar_CHChloe_Phase01_Chloe_008="Yes, Kate Marsh almost killed herself. Such sad. Okay? That doesn't make me feel any better about my fucked-up life, get it?"
Cue_E3_6A_TownCar_CHChloe_Phase01_Chloe_009="Jesus, she was banging that pig Frank! Bitch lied to my face, Max! I can't trust anybody again. Everybody pretends to care until they don't. Even you!"
Cue_E3_6A_TownCar_CHChloe_Phase01_Chloe_016="Okay, fine... But you just don't understand. It's like I'm being punished by the universe..."
Cue_E3_6A_TownCar_CHChloe_Phase01_Chloe_017="My fucking dad of course... hello!?"
Cue_E3_6A_TownCar_CHChloe_Phase01_Chloe_018="Yes, I do. Damn right. He chose to go out that door and leave me forever."
Cue_E3_6A_TownCar_CHChloe_Phase01_Chloe_019="I said "my dad"! My real father, who got himself killed for nothing! Not the human placeholder for Joyce."
Cue_E3_6A_TownCar_CHChloe_Phase01_Chloe_023="I know that, Max. My mom actually blames herself... just because she wanted a ride home from work. Sometimes even I blame her..."
Cue_E3_6A_TownCar_CHChloe_Phase01_Chloe_024="Yes, Max, I do. Do you know what it's like to wait for your father to come home when you're a kid... and he never does?"
Cue_E3_6A_TownCar_CHChloe_Phase01_Chloe_027="I wish that made me feel better. But ever since he died, my life has been dipped in shit."
Cue_E3_6A_TownCar_CHChloe_Phase01_Chloe_030="You're right. I don't want to hear this."
Cue_E3_6A_TownCar_CHChloe_Phase01_Chloe_031="I'd really love to believe that... I'd like to believe in something after what's happened..."
Cue_E3_6A_TownCar_CHChloe_Phase01_Chloe_033="Max, if I had your power, I would go all the way back and change everything! Everything...!"
Cue_E3_6A_TownCar_CHChloe_Phase01_Max_005="Chloe, you can't keep blaming me and everybody for everything wrong in your life. It's so not fair."
Cue_E3_6A_TownCar_CHChloe_Phase01_Max_010="It's just life, shit happens, it's nobody's fault, "blah blah blah," as Mr. Jefferson would say. And Kate Marsh..."
Cue_E3_6A_TownCar_CHChloe_Phase01_Max_011="Grow up. And I'm not trying to be mean. But you're not the only one in Arcadia Bay with problems. Kate Marsh killed herself, you know?"
Cue_E3_6A_TownCar_CHChloe_Phase01_Max_012="Grow up. God, you're not the only one in Arcadia Bay with problems. Kate Marsh almost..."
Cue_E3_6A_TownCar_CHChloe_Phase01_Max_013="So now it's Rachel's fault too?"
Cue_E3_6A_TownCar_CHChloe_Phase01_Max_014="So who do you most want to blame?"
Cue_E3_6A_TownCar_CHChloe_Phase01_Max_015="Chloe Price, you better take that back. Right now."
Cue_E3_6A_TownCar_CHChloe_Phase01_Max_020="You blame William? Really?"
Cue_E3_6A_TownCar_CHChloe_Phase01_Max_021="You blame David?"
Cue_E3_6A_TownCar_CHChloe_Phase01_Max_022="Chloe, your dad didn't choose to... "leave" you."
Cue_E3_6A_TownCar_CHChloe_Phase01_Max_025="No, you don't."
Cue_E3_6A_TownCar_CHChloe_Phase01_Max_026="No, of course not. But I was with you that day. It was just a terrible accident!"
Cue_E3_6A_TownCar_CHChloe_Phase01_Max_028="You don't want to hear this, but you're still here. Alive. With me. And that is no accident."
Cue_E3_6A_TownCar_CHChloe_Phase01_Max_029="I can tell... but look at everything that's happened the past week. Your life has changed mine and that's not shit."
Cue_E3_6A_TownCar_CHChloe_Phase01_Max_032="Chloe, I can't do this out on my own. I need you with me. And Rachel needs you..."
Cue_E3_6A_TownCar_CHChloe_Phase01_Max_034="If only I could..."
